tap "homebrew/bundle"
brew "go"
brew "graphviz"
brew "mas"
brew "python@3.12"
brew "ruby"
brew "sl"
brew "telnet"
brew "vim"
cask "alt-tab"
cask "spotify"
cask "visual-studio-code"
mas "Gifski", id: 1351639930
mas "Goodnotes", id: 1444383602
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Microsoft Remote Desktop", id: 1295203466
mas "RunCat", id: 1429033973
vscode "alefragnani.project-manager"
vscode "almenon.arepl"
vscode "astro-build.astro-vscode"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.path-intellisense"
vscode "csharpier.csharpier-vscode"
vscode "csholmq.excel-to-markdown-table"
vscode "DavidAnson.vscode-markdownlint"
vscode "donjayamanne.typescript-notebook"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "eeyore.yapf"
vscode "emilast.LogFileHighlighter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "Gruntfuggly.todo-tree"
vscode "henoc.svgeditor"
vscode "illixion.vscode-vibrancy-continued"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "jock.svg"
vscode "KevinRose.vsc-python-indent"
vscode "ktnrg45.vscode-cython"
vscode "Lakkannawalikar.css-converter"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "mushan.vscode-paste-image"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "riazxrazor.html-to-jsx"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "soerenuhrbach.vscode-deepl"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "telesoho.vscode-markdown-paste-image"
vscode "tomoki1207.pdf"
vscode "Tyriar.luna-paint"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "wholroyd.jinja"
vscode "Yukai.map-replace-js"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
